---
kind: property
id: P:Autodesk.Revit.DB.ScheduleField.FieldId
source: html/e7b1a3c3-1ab5-9e65-a59e-fed8a7d27d42.htm
---
# Autodesk.Revit.DB.ScheduleField.FieldId Property

The ID of the field in the containing ScheduleDefinition.

## Syntax (C#)
```csharp
public ScheduleFieldId FieldId { get; }
```